[
    {
        "id": "dog_food_1",
        "category": "Dogs",
        "subcategory": "Food",
        "name": "Premium Chicken & Rice Dog Food (5kg)",
        "description": "A gourmet, protein-rich blend crafted to fuel your dog’s daily adventures while supporting lean muscle maintenance and digestive harmony.",
        "price": 8500.0,
        "image": "assets/images/dog_food_1.jpg",
        "rating": 4.7,
        "ingredients": "Deboned Chicken, Brown Rice, Oatmeal, Chicken Fat, Flaxseed, Natural Flavor, Vitamins (E, A, D3, B12), Minerals (Zinc, Iron, Copper), Omega-3 & Omega-6 Fatty Acids",
        "healthBenefits": "High-quality protein supports strong muscles. Omega fatty acids promote healthy skin and shiny coat. Antioxidants boost immune system.",
        "targetAudience": "Adult dogs (1-7 years), All breeds, All sizes",
        "specialFeatures": "No artificial colors, flavors, or preservatives. Made with real deboned chicken.",
        "usageInstructions": "Feed according to weight. Small dogs (5-10kg): 1-1.5 cups daily. Divide into 2 meals."
    },
    {
        "id": "dog_food_2",
        "category": "Dogs",
        "subcategory": "Food",
        "name": "Puppy Growth Formula (3kg)",
        "description": "Nutrient-dense kibble enriched with DHA to spark brain development and build a sturdy foundation for your puppy’s lifelong health.",
        "price": 6500.0,
        "image": "assets/images/dog_food_2.jpg",
        "rating": 4.8,
        "ingredients": "Chicken Meal, Salmon Meal, Brown Rice, Sweet Potato, Fish Oil (DHA source), Probiotics, Calcium, Phosphorus",
        "healthBenefits": "DHA supports brain and vision development. Optimal calcium-phosphorus ratio promotes strong bones.",
        "targetAudience": "Puppies up to 12 months old, All breeds",
        "specialFeatures": "Small kibble size perfect for puppy mouths. Enhanced with DHA from fish oil.",
        "usageInstructions": "Feed 3-4 times daily for puppies under 6 months. Transition gradually over 7-10 days."
    },
    {
        "id": "dog_food_3",
        "category": "Dogs",
        "subcategory": "Food",
        "name": "Senior Dog Nutrition (4kg)",
        "description": "A gentle, restorative formula designed to revitalize aging companions, featuring specialized joint support and easy-to-digest antioxidants.",
        "price": 7200.0,
        "image": "assets/images/dog_food_3.jpg",
        "rating": 4.6,
        "ingredients": "Chicken, Rice, Glucosamine, Chondroitin, Fiber Blend, Omega Fatty Acids, Vitamin E, Selenium",
        "healthBenefits": "Glucosamine supports joint mobility. Reduced calories maintain ideal weight for less active dogs.",
        "targetAudience": "Senior dogs 7+ years old, All breeds",
        "specialFeatures": "Smaller kibble size easier to chew. Heart-healthy lower sodium content.",
        "usageInstructions": "Feed 2 times daily. For dogs with dental issues, can be moistened with warm water."
    },
    {
        "id": "dog_toy_1",
        "category": "Dogs",
        "subcategory": "Toys",
        "name": "Dental Chew Bones (Pack of 10)",
        "description": "Dual-action treats that scrub away plaque and neutralize 'doggy breath,' turning essential oral hygiene into a delicious daily ritual.",
        "price": 1200.0,
        "image": "assets/images/dog_toy_1.jpg",
        "rating": 4.2,
        "ingredients": "Rawhide, Natural Chicken Flavor, Parsley, Mint Extract, Calcium",
        "healthBenefits": "Reduces plaque and tartar buildup. Freshens breath naturally. Satisfies natural chewing instinct.",
        "targetAudience": "Adult dogs, Medium to large breeds",
        "specialFeatures": "Long-lasting chew. Natural ingredients. Mint and parsley for fresh breath.",
        "usageInstructions": "Give 1 chew bone daily. Supervise your dog while chewing. Not suitable for puppies under 6 months."
    },
    {
        "id": "dog_toy_2",
        "category": "Dogs",
        "subcategory": "Toys",
        "name": "Interactive Puzzle Toy",
        "description": "An engaging mental workout that challenges your dog’s problem-solving skills to curb boredom and prevent destructive behaviors.",
        "price": 1800.0,
        "image": "assets/images/dog_toy_2.jpg",
        "rating": 4.5,
        "ingredients": "Durable Non-Toxic Rubber, BPA-Free Plastic",
        "healthBenefits": "Provides mental stimulation and prevents boredom. Reduces anxiety and destructive behavior.",
        "targetAudience": "All adult dogs, Especially smart breeds",
        "specialFeatures": "Adjustable difficulty levels. Dishwasher safe. Can hold treats or kibble.",
        "usageInstructions": "Fill with treats or kibble. Start with easy level. Clean regularly with warm soapy water."
    },
    {
        "id": "dog_toy_3",
        "category": "Dogs",
        "subcategory": "Toys",
        "name": "Rope Tug Toy",
        "description": "A rugged, multi-textured rope built for high-energy play, doubling as a natural flosser to clean teeth during every game of tug-of-war.",
        "price": 850.0,
        "image": "assets/images/dog_toy_3.jpg",
        "rating": 4.3,
        "ingredients": "100% Natural Cotton Rope, Non-Toxic Dyes",
        "healthBenefits": "Helps clean teeth while playing. Strengthens bond through interactive play.",
        "targetAudience": "Medium to large dogs, Active dogs",
        "specialFeatures": "Durable cotton rope. Machine washable. Multiple grip points.",
        "usageInstructions": "Use for interactive tug-of-war. Replace when rope becomes frayed. Supervise play."
    },
    {
        "id": "dog_acc_1",
        "category": "Dogs",
        "subcategory": "Accessories",
        "name": "TropiClean Oatmeal Shampoo",
        "description": "A spa-quality, soap-free wash that instantly calms irritated skin and leaves your pet’s coat smelling tropical and feeling silky.",
        "price": 4500.0,
        "image": "assets/images/dog_acc_1.png",
        "rating": 4.5,
        "ingredients": "Oatmeal, Aloe Vera, Coconut Oil, Vitamin E, Natural Extracts, pH Balanced Formula",
        "healthBenefits": "Soothes dry and itchy skin. Moisturizes coat and skin. Hypoallergenic formula.",
        "targetAudience": "Dogs with sensitive skin, All breeds",
        "specialFeatures": "Soap-free formula. pH balanced for dogs. Natural ingredients.",
        "usageInstructions": "Wet coat thoroughly. Massage into coat. Leave on for 3-5 minutes. Rinse completely."
    },
    {
        "id": "dog_acc_2",
        "category": "Dogs",
        "subcategory": "Accessories",
        "name": "Adjustable Nylon Collar",
        "description": "A blend of safety and style, featuring high-visibility reflective stitching and a secure, quick-release buckle for everyday peace of mind.",
        "price": 950.0,
        "image": "assets/images/dog_acc_2.png",
        "rating": 4.4,
        "ingredients": "Heavy-Duty Nylon Webbing, Reflective Thread, Quick-Release Buckle, Stainless Steel D-Ring",
        "healthBenefits": "Comfortable fit prevents neck strain. Reflective stitching ensures visibility at night.",
        "targetAudience": "All dogs, Adjustable for neck sizes 30-50cm",
        "specialFeatures": "Reflective stitching for night safety. Quick-release buckle. Durable D-ring.",
        "usageInstructions": "Adjust to fit snugly - should fit two fingers between collar and neck. Check fit regularly."
    },
    {
        "id": "dog_acc_3",
        "category": "Dogs",
        "subcategory": "Accessories",
        "name": "Retractable Leash (5m)",
        "description": "Give your dog the freedom to explore with a tangle-free, heavy-duty cord and an intuitive one-touch braking system for total control.",
        "price": 1500.0,
        "image": "assets/images/dog_acc_3.png",
        "rating": 4.6,
        "ingredients": "Nylon Cord, ABS Plastic Housing, Ergonomic Rubber Grip",
        "healthBenefits": "Allows natural movement and exploration. Provides exercise freedom while maintaining safety.",
        "targetAudience": "Dogs up to 50kg, All breeds",
        "specialFeatures": "One-button brake and lock system. 5-meter retractable cord. Ergonomic grip.",
        "usageInstructions": "Attach to collar or harness. Press button to lock at desired length. Use brake for quick stops."
    },
    {
        "id": "dog_treat_1",
        "category": "Dogs",
        "subcategory": "Treats",
        "name": "Training Treats (500g)",
        "description": "Succulent, bite-sized rewards designed to keep your dog focused and motivated without over-calculating their daily calorie intake.",
        "price": 650.0,
        "image": "assets/images/dog_treat_1.jpg",
        "rating": 4.7,
        "ingredients": "Chicken, Sweet Potato, Peas, Glycerin, Natural Flavors, Vitamins",
        "healthBenefits": "Low calorie for frequent rewards. Soft texture easy to chew quickly.",
        "targetAudience": "All dogs, Especially for training, Puppies and adults",
        "specialFeatures": "Small bite-sized pieces. Low calorie (3 calories per treat). Resealable bag.",
        "usageInstructions": "Use as rewards during training. Give 5-10 treats per session. Store in cool, dry place."
    },
    {
        "id": "cat_food_1",
        "category": "Cats",
        "subcategory": "Food",
        "name": "Ocean Catch Wet Food (12 Pack)",
        "description": "A moisture-rich feast of flaky tuna and salmon that mimics a cat’s natural diet while promoting optimal kidney and urinary health.",
        "price": 750.0,
        "image": "assets/images/cat_food_1.jpg",
        "rating": 4.4,
        "ingredients": "Whole Tuna, Salmon, Water Sufficient for Processing, Taurine, Vitamin E Supplement",
        "healthBenefits": "High moisture content supports urinary tract health. Taurine supports heart and eye health.",
        "targetAudience": "Adult cats, All breeds",
        "specialFeatures": "Real fish pieces. No artificial thickeners. Rich in Omega-3.",
        "usageInstructions": "Feed 1 can per 1.5kg of body weight daily. Serve at room temperature. Refrigerate leftovers."
    },
    {
        "id": "cat_food_2",
        "category": "Cats",
        "subcategory": "Food",
        "name": "Grain-Free Salmon Formula (3kg)",
        "description": "High-performance, hypoallergenic nutrition that prioritizes real fish over fillers to give your cat a radiant coat and boundless energy.",
        "price": 5200.0,
        "image": "assets/images/cat_food_2.jpg",
        "rating": 4.8,
        "ingredients": "Deboned Salmon, Chicken Meal, Peas, Lentils, Tapioca Starch, Cranberries, Blueberries",
        "healthBenefits": "Grain-free for sensitive stomachs. Cranberries support urinary health. Blueberries provide antioxidants.",
        "targetAudience": "Adult cats, Cats with grain sensitivities",
        "specialFeatures": "Grain-free. High protein content. Holistic ingredients.",
        "usageInstructions": "Feed 1/2 to 3/4 cup daily for average cats. Adjust based on activity levels. Always provide water."
    },
    {
        "id": "cat_food_3",
        "category": "Cats",
        "subcategory": "Food",
        "name": "Kitten Growth Formula (2kg)",
        "description": "A velvety, protein-packed start for your little hunter, balanced with essential minerals for rapid bone growth and immune defense.",
        "price": 4500.0,
        "image": "assets/images/cat_food_3.jpg",
        "rating": 4.7,
        "ingredients": "Chicken Meal, Dried Egg Product, Fish Oil, Brewers Rice, Beet Pulp, Potassium Chloride",
        "healthBenefits": "High protein for rapid growth. DHA from fish oil for brain development. Small kibble for tiny mouths.",
        "targetAudience": "Kittens up to 12 months, Pregnant or nursing cats",
        "specialFeatures": "Nutrient-dense. Easy to digest. Natural DHA sources.",
        "usageInstructions": "Kittens (under 4 months): 1/2-1 cup. (4-12 months): 1/2-3/4 cup. Feed multiple times daily."
    },
    {
        "id": "cat_toy_1",
        "category": "Cats",
        "subcategory": "Toys",
        "name": "Catnip Toy Mouse",
        "description": "An irresistible, aromatic plush toy that triggers natural hunting instincts, providing hours of pouncing, batting, and active exercise.",
        "price": 450.0,
        "image": "assets/images/cat_toy_1.avif",
        "rating": 4.0,
        "ingredients": "Plush Fabric, Organic North American Catnip, Polyester Filling",
        "healthBenefits": "Encourages natural hunting instincts. Reduces stress through play and catnip exposure.",
        "targetAudience": "Cats of all ages",
        "specialFeatures": "Refillable catnip pouch. Double-stitched for durability. Realistic mouse shape.",
        "usageInstructions": "Toss to cat to initiate play. Store in a sealed container when not in use to keep catnip fresh."
    },
    {
        "id": "cat_toy_2",
        "category": "Cats",
        "subcategory": "Toys",
        "name": "Feather Wand Interactive Toy",
        "description": "Strengthen the bond with your feline friend using this aerodynamic wand that mimics the unpredictable flight of prey.",
        "price": 550.0,
        "image": "assets/images/cat_toy_2.jpg",
        "rating": 4.5,
        "ingredients": "Carbon Fiber Wand, Natural Bird Feathers, Braided Wire, Foam Grip",
        "healthBenefits": "Improves agility and speed. Provides essential cardiovascular exercise for indoor cats.",
        "targetAudience": "Active cats, Kittens",
        "specialFeatures": "Telescopic wand. Realistic feather movement. Safe, break-away wire.",
        "usageInstructions": "Sweep wand through the air or across the floor. Do not allow cat to chew or swallow feathers."
    },
    {
        "id": "cat_toy_3",
        "category": "Cats",
        "subcategory": "Toys",
        "name": "Laser Pointer Toy",
        "description": "An automated, erratic light show that provides a high-intensity cardio workout for even the most sedentary indoor cats.",
        "price": 1200.0,
        "image": "assets/images/cat_toy_3.jpg",
        "rating": 4.3,
        "ingredients": "ABS Plastic, Class II Laser, Electronic Components",
        "healthBenefits": "Provides high-intensity exercise. Mentally stimulates through erratic movement.",
        "targetAudience": "Bored cats, Weight management cases",
        "specialFeatures": "360-degree rotation. Automatic timer (15 min). Adjustable speed settings.",
        "usageInstructions": "Place on a flat surface or hold by hand. Never shine directly into eyes. End session with a physical toy."
    },
    {
        "id": "cat_acc_1",
        "category": "Cats",
        "subcategory": "Accessories",
        "name": "Clumping Litter 10L",
        "description": "Superior odor-trapping clay that forms rock-solid clumps instantly, making litter box maintenance effortless and keeping your home fresh.",
        "price": 2200.0,
        "image": "assets/images/cat_acc_1.jpg",
        "rating": 4.6,
        "ingredients": "Natural Sodium Bentonite Clay, Activated Charcoal, Fragrance Micro-capsules",
        "healthBenefits": "99% dust-free to protect respiratory health. Prevents bacterial growth through quick clumping.",
        "targetAudience": "Indoor cats, Multi-cat households",
        "specialFeatures": "Instant-clump technology. 10-day odor protection. Soft on paws.",
        "usageInstructions": "Fill box to 3-4 inches. Scoop daily. Replace entire box monthly. Do not flush."
    },
    {
        "id": "cat_acc_2",
        "category": "Cats",
        "subcategory": "Accessories",
        "name": "Breakaway Safety Collar",
        "description": "A feather-light, stylish collar engineered to release instantly if snagged, ensuring your cat’s safety during climbs and leaps.",
        "price": 450.0,
        "image": "assets/images/cat_acc_2.jpg",
        "rating": 4.4,
        "ingredients": "Nylon Webbing, Plastic Breakaway Buckle, Steel Bell",
        "healthBenefits": "Safety buckle releases if snagged, preventing strangulation. Bell warns local wildlife.",
        "targetAudience": "All cats, Outdoor/Indoor cats",
        "specialFeatures": "Reflective striping. High-decibel bell. Breakaway safety clasp.",
        "usageInstructions": "Adjust so two fingers fit underneath. Check weekly for wear or size changes."
    },
    {
        "id": "cat_acc_3",
        "category": "Cats",
        "subcategory": "Accessories",
        "name": "Scratching Post Tower",
        "description": "A vertical playground of durable sisal and plush tiers that satisfies the urge to scratch while protecting your valuable furniture.",
        "price": 3500.0,
        "image": "assets/images/cat_acc_3.jpg",
        "rating": 4.7,
        "ingredients": "Natural Sisal Rope, Faux Fur, Engineered Wood, Particle Board",
        "healthBenefits": "Maintains claw health through shedding of outer sheaths. Provides a safe outlet for marking behavior.",
        "targetAudience": "All cats, Especially those prone to scratching furniture",
        "specialFeatures": "Weighted base for stability. Built-in hanging toy. Durable sisal wrap.",
        "usageInstructions": "Place in an area where your cat spends time. Encourage use with catnip spray."
    },
    {
        "id": "cat_treat_1",
        "category": "Cats",
        "subcategory": "Treats",
        "name": "Salmon Flavor Treats (200g)",
        "description": "Crunchy, savory bites that help reduce tartar buildup, offering a rewarding 'crunch' that cats find absolutely addictive.",
        "price": 580.0,
        "image": "assets/images/cat_treat_1.jpg",
        "rating": 4.6,
        "ingredients": "Salmon, Chicken Meal, Animal Fat, Corn Gluten Meal, Natural Flavors",
        "healthBenefits": "Tartar control through crunchy texture. High protein boost between meals.",
        "targetAudience": "Adult cats, Finicky eaters",
        "specialFeatures": "Under 2 calories per treat. Resealable stay-fresh pouch. No artificial flavors.",
        "usageInstructions": "Give up to 10 treats per day. Not intended as a meal replacement. Provide water."
    },
    {
        "id": "bird_food_1",
        "category": "Birds",
        "subcategory": "Food",
        "name": "Parrot Seed Mix 2kg",
        "description": "A diverse, orchard-inspired blend of premium seeds and sun-dried fruits that encourages natural foraging and vibrant plumage.",
        "price": 1900.0,
        "image": "assets/images/bird_food_1.jpg",
        "rating": 4.3,
        "ingredients": "Striped Sunflower Seeds, Safflower, Whole Corn, Dried Papaya, Dried Pineapple, Peanuts",
        "healthBenefits": "Vitamin A for feather color. High energy for flight and play. Fiber for digestion.",
        "targetAudience": "Parrots, African Greys, Cockatoos",
        "specialFeatures": "Dust-cleaned seeds. Natural fruit pieces. No synthetic dyes.",
        "usageInstructions": "Fill seed cup daily. Remove hulls. Supplement with fresh greens and fruits."
    },
    {
        "id": "bird_food_2",
        "category": "Birds",
        "subcategory": "Food",
        "name": "Canary Food Mix (1kg)",
        "description": "A delicate, vitamin-fortified seed selection specifically balanced to fuel the high metabolism and beautiful melodies of songbirds.",
        "price": 850.0,
        "image": "assets/images/bird_food_2.jpg",
        "rating": 4.5,
        "ingredients": "Canary Grass Seed, Rape Seed, Flax Seed, Hemp Seed, Nyjer Seed, Vitamin Granules",
        "healthBenefits": "Supports song production. Enhances yellow and red feather pigments. High protein for molting.",
        "targetAudience": "Canaries, Finches",
        "specialFeatures": "Small seed variety. Fortified with vitamins. Triple-cleaned for purity.",
        "usageInstructions": "Provide 1-2 teaspoons daily per bird. Ensure daily water change."
    },
    {
        "id": "bird_food_3",
        "category": "Birds",
        "subcategory": "Food",
        "name": "Budgie Pellets (500g)",
        "description": "Science-based, uniform nutrition that eliminates selective eating, ensuring your bird receives 100% of the vitamins required for longevity.",
        "price": 650.0,
        "image": "assets/images/bird_food_3.jpg",
        "rating": 4.4,
        "ingredients": "Ground Corn, Soybean Meal, Wheat Germ, Vegetable Oil, Calcium Carbonate",
        "healthBenefits": "Prevents selective eating habits. Consistent vitamin intake. Reduces waste.",
        "targetAudience": "Budgies (Parakeets), Lovebirds",
        "specialFeatures": "Nutritionally complete. Uniform shape and size. Fruity aroma.",
        "usageInstructions": "Transition from seeds slowly. Pellets should be 60-70% of total diet."
    },
    {
        "id": "bird_toy_1",
        "category": "Birds",
        "subcategory": "Toys",
        "name": "Bird Swing",
        "description": "A rustic, birchwood perch that provides vital exercise for balance and a cozy, elevated spot for your bird to survey its kingdom.",
        "price": 650.0,
        "image": "assets/images/bird_toy_1.jpg",
        "rating": 4.1,
        "ingredients": "Kiln-dried Birch Wood, Non-Toxic Glue, Steel Hanging Hook",
        "healthBenefits": "Improves balance and coordination. Provides a sense of security while sleeping.",
        "targetAudience": "Small to medium birds",
        "specialFeatures": "Natural texture for grip. Sturdy construction. Easy-clip attachment.",
        "usageInstructions": "Hang in the upper center of the cage. Check for splinters over time."
    },
    {
        "id": "bird_toy_2",
        "category": "Birds",
        "subcategory": "Toys",
        "name": "Mirror with Bell Toy",
        "description": "A stimulating social accessory that provides companionship and musical entertainment to brighten your bird’s daily environment.",
        "price": 450.0,
        "image": "assets/images/bird_toy_2.jpg",
        "rating": 4.2,
        "ingredients": "Safety Glass Mirror, BPA-free Plastic Frame, Metal Bell",
        "healthBenefits": "Reduces loneliness for single birds. Stimulates social behavior and vocalization.",
        "targetAudience": "Budgies, Cockatiels, Finches",
        "specialFeatures": "Unbreakable safety glass. Bright colors. Audible bell.",
        "usageInstructions": "Attach to the side of the cage near a perch. Clean mirror with water only."
    },
    {
        "id": "bird_toy_3",
        "category": "Birds",
        "subcategory": "Toys",
        "name": "Rope Perch",
        "description": "A flexible, cotton-soft habitat addition that prevents foot fatigue by offering varying grip diameters and customizable climbing paths.",
        "price": 750.0,
        "image": "assets/images/bird_toy_3.jpg",
        "rating": 4.3,
        "ingredients": "Cotton Rope, Internal Bending Wire, Plastic End Caps",
        "healthBenefits": "Varying diameter prevents foot sores (bumblefoot). Exercises leg and foot muscles.",
        "targetAudience": "All pet birds",
        "specialFeatures": "Bends to any shape. Soft on feet. Washable cotton.",
        "usageInstructions": "Twist onto cage bars. Change the shape weekly to provide new challenges."
    },
    {
        "id": "bird_acc_1",
        "category": "Birds",
        "subcategory": "Accessories",
        "name": "Cuttlebone Pack (3 pieces)",
        "description": "An essential marine mineral source that naturally files down growing beaks while providing a vital boost of bioavailable calcium.",
        "price": 250.0,
        "image": "assets/images/bird_acc_1.jpg",
        "rating": 4.4,
        "ingredients": "Natural Cuttlefish Bone",
        "healthBenefits": "Natural source of calcium and minerals. Keeps beaks trimmed and sharp.",
        "targetAudience": "All cage birds",
        "specialFeatures": "100% natural. Includes metal holder. Harvested from the sea.",
        "usageInstructions": "Attach to cage with soft side facing the bird. Replace once mostly consumed."
    },
    {
        "id": "bird_acc_2",
        "category": "Birds",
        "subcategory": "Accessories",
        "name": "Bird Bath Bowl",
        "description": "A secure, splash-proof oasis that encourages natural preening behaviors and keeps feathers pristine and dust-free.",
        "price": 550.0,
        "image": "assets/images/bird_acc_2.jpg",
        "rating": 4.3,
        "ingredients": "Food-grade Plastic, Stainless Steel Screws",
        "healthBenefits": "Helps remove dust and dander from feathers. Essential for skin hydration and preening.",
        "targetAudience": "Small birds like Budgies and Canaries",
        "specialFeatures": "Anti-slip floor. Universal cage hooks. Transparent cover.",
        "usageInstructions": "Fill with lukewarm water. Offer 2-3 times per week. Remove after 1 hour."
    },
    {
        "id": "bird_acc_3",
        "category": "Birds",
        "subcategory": "Accessories",
        "name": "Cage Cover (Large)",
        "description": "A blackout, breathable sanctuary wrap that helps regulate your bird’s circadian rhythm for deep, restorative sleep.",
        "price": 1200.0,
        "image": "assets/images/bird_acc_3.jpg",
        "rating": 4.2,
        "ingredients": "Light-blocking Polyester, Breathable Mesh Panels",
        "healthBenefits": "Reduces night frights. Ensures 10-12 hours of uninterrupted sleep for mental health.",
        "targetAudience": "Large Parrot cages",
        "specialFeatures": "Velcro closures. Machine washable. Non-toxic fabric.",
        "usageInstructions": "Drape over cage at sunset. Ensure mesh panels are aligned with vents."
    },
    {
        "id": "bird_treat_1",
        "category": "Birds",
        "subcategory": "Treats",
        "name": "Honey Sticks (Pack of 5)",
        "description": "A gourmet 'foraging treat' baked with golden honey to provide a natural energy burst during molting or breeding seasons.",
        "price": 450.0,
        "image": "assets/images/bird_treat_1.jpg",
        "rating": 4.5,
        "ingredients": "Millet, Honey, Egg Product, Niger Seed, Wheat Flour",
        "healthBenefits": "Provides foraging activity. High energy for breeding or molting seasons.",
        "targetAudience": "Small to medium birds",
        "specialFeatures": "Triple-baked for crunch. Natural wood center. Easy hang clip.",
        "usageInstructions": "Hang from cage roof. Limit to one stick per week to prevent obesity."
    },
    {
        "id": "fish_food_1",
        "category": "Fish",
        "subcategory": "Food",
        "name": "Tropical Flake Food 250g",
        "description": "A precision-balanced, color-enhancing formula that stays afloat longer to ensure all community fish receive optimal nutrition.",
        "price": 380.0,
        "image": "assets/images/fish_food_1.jpg",
        "rating": 4.2,
        "ingredients": "Fish Meal, Dried Yeast, Ground Brown Rice, Shrimp Meal, Algae Meal",
        "healthBenefits": "Natural pigments enhance fish color. Vitamin C supports immune system.",
        "targetAudience": "Tropical community fish (Tetras, Guppies)",
        "specialFeatures": "Clean water formula. High protein. Float-then-sink design.",
        "usageInstructions": "Feed 2-3 times daily. Only as much as fish can consume in 3 minutes."
    },
    {
        "id": "fish_food_2",
        "category": "Fish",
        "subcategory": "Food",
        "name": "Goldfish Pellets (500g)",
        "description": "Expertly crafted, fiber-rich pellets that support the unique digestive needs of goldfish while preventing water cloudiness.",
        "price": 450.0,
        "image": "assets/images/fish_food_2.jpg",
        "rating": 4.4,
        "ingredients": "Wheat Germ Meal, White Fish Meal, Spirulina, Garlic, Probiotics",
        "healthBenefits": "Low protein/high fiber for goldfish digestion. Spirulina for vibrant scales.",
        "targetAudience": "Goldfish, Koi",
        "specialFeatures": "Sinking/Floating options. Non-clouding. Rich in antioxidants.",
        "usageInstructions": "Feed once daily. Avoid overfeeding as goldfish have no stomachs."
    },
    {
        "id": "fish_food_3",
        "category": "Fish",
        "subcategory": "Food",
        "name": "Betta Fish Food (100g)",
        "description": "Nutrient-dense micro-pellets formulated with high-quality proteins to enhance the majestic finnage and bold colors of Betta fish.",
        "price": 320.0,
        "image": "assets/images/fish_food_3.jpg",
        "rating": 4.6,
        "ingredients": "Brine Shrimp Meal, Bloodworms, Krill, Vitamin B12, Calcium",
        "healthBenefits": "High protein supports fin growth and repair. Enhances natural aggression and alertness.",
        "targetAudience": "Betta Splendens",
        "specialFeatures": "Micro-pellet size. Highly palatable. Contains garlic to entice eaters.",
        "usageInstructions": "Feed 2-3 pellets twice daily. Remove uneaten food immediately."
    },
    {
        "id": "fish_toy_1",
        "category": "Fish",
        "subcategory": "Toys",
        "name": "Decorative Aquarium Plant Pack",
        "description": "Life-like, silk-textured greenery that creates a lush underwater landscape and vital hiding zones without any maintenance.",
        "price": 900.0,
        "image": "assets/images/fish_toy_1.jpg",
        "rating": 4.0,
        "ingredients": "Non-toxic Silk/Plastic, Ceramic weighted base",
        "healthBenefits": "Provides hiding spots to reduce stress. Breaks lines of sight for aggressive species.",
        "targetAudience": "All freshwater aquariums",
        "specialFeatures": "Vibrant colors. Safe for fins. No maintenance required.",
        "usageInstructions": "Rinse in warm water before placement. Bury bases in substrate."
    },
    {
        "id": "fish_toy_2",
        "category": "Fish",
        "subcategory": "Toys",
        "name": "Aquarium Castle Decoration",
        "description": "A majestic, non-toxic centerpiece that provides essential swim-through architecture and territory for shy or nocturnal species.",
        "price": 1200.0,
        "image": "assets/images/fish_toy_2.jpg",
        "rating": 4.3,
        "ingredients": "Polyresin, Non-toxic Paint",
        "healthBenefits": "Territory marking. Shelter for nocturnal fish and fry (baby fish).",
        "targetAudience": "Medium sized tanks (20L+)",
        "specialFeatures": "Swim-through holes. Hand-painted detail. pH neutral.",
        "usageInstructions": "Clean monthly with a soft brush during water changes."
    },
    {
        "id": "fish_toy_3",
        "category": "Fish",
        "subcategory": "Toys",
        "name": "Floating Log Decoration",
        "description": "A realistic, buoyant retreat that offers surface-dwelling fish a secure place to rest and feed, mimicking natural river debris.",
        "price": 650.0,
        "image": "assets/images/fish_toy_3.jpg",
        "rating": 4.1,
        "ingredients": "Resin, Air-pockets for buoyancy",
        "healthBenefits": "Encourages surface interaction. Provides a resting spot for Betta fish.",
        "targetAudience": "Bettas, Gouramis, Newts",
        "specialFeatures": "Realistic wood texture. Floats indefinitely. Top-feeding hole.",
        "usageInstructions": "Place on the surface. Ensure it doesn't block the filter intake."
    },
    {
        "id": "fish_acc_1",
        "category": "Fish",
        "subcategory": "Accessories",
        "name": "Aquarium Water Conditioner 500ml",
        "description": "A professional-grade formula that instantly neutralizes harsh tap water chemicals and bolsters the protective slime coat of your fish.",
        "price": 650.0,
        "image": "assets/images/fish_acc_1.jpg",
        "rating": 4.5,
        "ingredients": "Sodium Thiosulfate, EDTA, Aloe Vera extract",
        "healthBenefits": "Prevents gill burn from chlorine. Aloe vera promotes slime coat recovery.",
        "targetAudience": "All aquarium owners",
        "specialFeatures": "Instant action. Concentrated formula. Safe for invertebrates.",
        "usageInstructions": "Add 5ml per 40L of new tap water during water changes."
    },
    {
        "id": "fish_acc_2",
        "category": "Fish",
        "subcategory": "Accessories",
        "name": "Aquarium Filter (Small)",
        "description": "A whisper-quiet, three-stage filtration system that maintains crystal-clear water and a healthy biological balance in smaller setups.",
        "price": 2500.0,
        "image": "assets/images/fish_acc_2.jpg",
        "rating": 4.7,
        "ingredients": "ABS Plastic Housing, Sponge Media, Carbon Cartridge",
        "healthBenefits": "Removes ammonia and nitrites. Aerates water for oxygenation.",
        "targetAudience": "Tanks up to 30 liters",
        "specialFeatures": "Adjustable flow rate. Silent motor. 3-stage filtration.",
        "usageInstructions": "Submerge fully. Rinse sponge in old tank water only to preserve bacteria."
    },
    {
        "id": "fish_acc_3",
        "category": "Fish",
        "subcategory": "Accessories",
        "name": "LED Aquarium Light",
        "description": "Energy-efficient lighting that brings out the hidden shimmer of your fish and supports the photosynthesis of live aquatic plants.",
        "price": 1800.0,
        "image": "assets/images/fish_acc_3.jpg",
        "rating": 4.6,
        "ingredients": "Aluminum Alloy Heat Sink, SMD LED Chips, Acrylic Lens",
        "healthBenefits": "Simulates natural day/night cycles. Promotes healthy live plant growth.",
        "targetAudience": "Standard rectangular tanks",
        "specialFeatures": "Moonlight mode. Touch control. Slim profile.",
        "usageInstructions": "Mount on cage rim. Use for 8-10 hours daily to prevent algae."
    },
    {
        "id": "fish_treat_1",
        "category": "Fish",
        "subcategory": "Treats",
        "name": "Freeze-Dried Bloodworms",
        "description": "A pure, protein-dense delicacy that provides a natural 'live-prey' taste without the risk of introducing aquarium parasites.",
        "price": 550.0,
        "image": "assets/images/fish_treat_1.jpg",
        "rating": 4.8,
        "ingredients": "100% Freeze-dried Bloodworms",
        "healthBenefits": "Pure protein for growth and vitality. No parasites (common in live food).",
        "targetAudience": "Carnivorous and omnivorous fish",
        "specialFeatures": "Freshness locked. Floating treats. Resealable tin.",
        "usageInstructions": "Offer twice weekly as a supplement. Soak in water before feeding to prevent bloat."
    },
    {
        "id": "reptile_food_1",
        "category": "Reptiles",
        "subcategory": "Food",
        "name": "Reptile Pellets (1kg)",
        "description": "A nutritionally complete, alfalfa-based diet fortified with Vitamin D3 to ensure strong skeletal health and vitality.",
        "price": 1500.0,
        "image": "assets/images/reptile_food_1.jpg",
        "rating": 4.3,
        "ingredients": "Alfalfa Meal, Soy Hulls, Rice Bran, Vitamin D3, Calcium Phosphate",
        "healthBenefits": "Vitamin D3 for calcium absorption. Prevents metabolic bone disease (MBD).",
        "targetAudience": "Iguanas, Tortoises, Bearded Dragons",
        "specialFeatures": "High fiber. Color-enhanced. Long shelf life.",
        "usageInstructions": "Moisten with water or fruit juice before feeding to young reptiles."
    },
    {
        "id": "reptile_food_2",
        "category": "Reptiles",
        "subcategory": "Food",
        "name": "Dried Crickets (200g)",
        "description": "A convenient, 'gut-loaded' protein source that provides the essential amino acids reptiles need for growth and energy.",
        "price": 850.0,
        "image": "assets/images/reptile_food_2.jpg",
        "rating": 4.5,
        "ingredients": "Whole Dried Crickets",
        "healthBenefits": "Excellent source of amino acids. Provides variety in the diet.",
        "targetAudience": "Lizards, Frogs, Small monitors",
        "specialFeatures": "Gut-loaded before drying. No preservatives. High palatability.",
        "usageInstructions": "Feed as a primary source or supplement. Dust with calcium powder."
    },
    {
        "id": "reptile_food_3",
        "category": "Reptiles",
        "subcategory": "Food",
        "name": "Mealworms (500g)",
        "description": "A high-calorie, energy-rich supplement perfect for growing juveniles or reptiles needing a boost in their daily fat intake.",
        "price": 950.0,
        "image": "assets/images/reptile_food_3.jpg",
        "rating": 4.4,
        "ingredients": "Farm-raised Mealworms (Dried)",
        "healthBenefits": "High fat content for weight gain in recovering animals. High protein.",
        "targetAudience": "Geckos, Skinks, Chameleons",
        "specialFeatures": "Vacuum sealed. Easy to store. Clean and odorless.",
        "usageInstructions": "Feed in a shallow dish to prevent escapes into substrate."
    },
    {
        "id": "reptile_toy_1",
        "category": "Reptiles",
        "subcategory": "Toys",
        "name": "Climbing Branch",
        "description": "A sandblasted, natural grapevine that adds vertical dimension to your terrarium while assisting with healthy skin shedding.",
        "price": 1200.0,
        "image": "assets/images/reptile_toy_1.jpg",
        "rating": 4.2,
        "ingredients": "Sandblasted Grapevine or Driftwood",
        "healthBenefits": "Encourages natural climbing behavior. Helps in shedding by providing friction.",
        "targetAudience": "Arboreal reptiles (Chameleons, Crested Geckos)",
        "specialFeatures": "Unique shapes. Mold resistant. Chemically untreated.",
        "usageInstructions": "Secure firmly to the enclosure walls to prevent falls."
    },
    {
        "id": "reptile_toy_2",
        "category": "Reptiles",
        "subcategory": "Toys",
        "name": "Rock Cave Hideout",
        "description": "A rugged, non-porous sanctuary that offers a cool, dark retreat for reptiles to thermoregulate and feel completely secure.",
        "price": 1500.0,
        "image": "assets/images/reptile_toy_2.jpg",
        "rating": 4.4,
        "ingredients": "High-density Resin",
        "healthBenefits": "Reduces stress by providing a secure hiding area. Helps regulate body temperature.",
        "targetAudience": "Snakes, Leopard Geckos",
        "specialFeatures": "Non-porous surface. Weighted to prevent tipping. Easy to disinfect.",
        "usageInstructions": "Place on the cool side of the enclosure. Wash weekly."
    },
    {
        "id": "reptile_toy_3",
        "category": "Reptiles",
        "subcategory": "Toys",
        "name": "Hammock for Reptiles",
        "description": "A sturdy, elevated lounging mesh that utilizes the 'warm zone' of the enclosure, providing a unique basking experience.",
        "price": 650.0,
        "image": "assets/images/reptile_toy_3.jpg",
        "rating": 4.1,
        "ingredients": "Nylon Mesh, Suction Cups",
        "healthBenefits": "Utilizes vertical space. Provides a unique basking spot closer to heat lamps.",
        "targetAudience": "Bearded Dragons, Geckos",
        "specialFeatures": "Breathable mesh. Strong suction. Machine washable.",
        "usageInstructions": "Attach to glass corners. Ensure it's not too close to high-wattage bulbs."
    },
    {
        "id": "reptile_acc_1",
        "category": "Reptiles",
        "subcategory": "Accessories",
        "name": "Heat Lamp (50W)",
        "description": "A focused, UVA-emitting thermal source that simulates natural sunlight to kickstart your reptile's metabolism and digestion.",
        "price": 2200.0,
        "image": "assets/images/reptile_acc_1.jpg",
        "rating": 4.3,
        "ingredients": "Neodymium Glass, Tungsten Filament",
        "healthBenefits": "Essential for digestion and metabolism in cold-blooded animals.",
        "targetAudience": "Diurnal reptiles",
        "specialFeatures": "UVA emitting. Focused beam. 2000-hour life.",
        "usageInstructions": "Use with a ceramic socket. Keep away from water and flammable materials."
    },
    {
        "id": "reptile_acc_2",
        "category": "Reptiles",
        "subcategory": "Accessories",
        "name": "Reptile Substrate 10L",
        "description": "Eco-friendly, moisture-retaining coconut husk that creates a soft, natural floor for burrowing and maintaining humidity.",
        "price": 1300.0,
        "image": "assets/images/reptile_acc_2.jpg",
        "rating": 4.1,
        "ingredients": "Coconut Husk Fiber (Coir)",
        "healthBenefits": "Maintains humidity levels. Soft on reptile bellies and toes.",
        "targetAudience": "Tropical species (Pythons, Geckos)",
        "specialFeatures": "Eco-friendly. Expandable. Naturally mold resistant.",
        "usageInstructions": "Soak in water to expand. Replace every 2-3 months."
    },
    {
        "id": "reptile_acc_3",
        "category": "Reptiles",
        "subcategory": "Accessories",
        "name": "Thermometer & Hygrometer",
        "description": "A high-precision digital monitor that ensures your pet's environment stays within the critical 'Goldilocks zone' for health.",
        "price": 1800.0,
        "image": "assets/images/reptile_acc_3.jpg",
        "rating": 4.6,
        "ingredients": "ABS Plastic, Digital Sensor Probes",
        "healthBenefits": "Ensures the environment stays within safe physiological limits.",
        "targetAudience": "All reptile enclosures",
        "specialFeatures": "Min/Max memory. Duel probes. Large LCD.",
        "usageInstructions": "Place probes at both ends of the tank to monitor the thermal gradient."
    },
    {
        "id": "reptile_treat_1",
        "category": "Reptiles",
        "subcategory": "Treats",
        "name": "Calcium Supplement",
        "description": "An ultra-fine, phosphorus-free powder designed to coat feeders easily, preventing metabolic bone disease in all life stages.",
        "price": 550.0,
        "image": "assets/images/reptile_treat_1.jpg",
        "rating": 4.4,
        "ingredients": "Calcium Carbonate, Vitamin D3",
        "healthBenefits": "Critical for preventing metabolic bone disease. Supports egg production.",
        "targetAudience": "All lizards and turtles",
        "specialFeatures": "Ultrafine powder. Phosphorus-free. High absorption.",
        "usageInstructions": "Lightly dust insects or greens before feeding."
    },
    {
        "id": "hamster_food_1",
        "category": "Hamsters",
        "subcategory": "Food",
        "name": "Seed Mix 1kg",
        "description": "A harvest-themed variety of grains and nuts that encourages the natural 'pouching' and hoarding instincts of curious hamsters.",
        "price": 420.0,
        "image": "assets/images/hamster_food_1.jpg",
        "rating": 4.0,
        "ingredients": "Sunflowers, Peanuts, Wheat, Millet, Corn, Dried Peas",
        "healthBenefits": "Provides energy for exercise. Encourages foraging and pouching behavior.",
        "targetAudience": "Syrian and Dwarf Hamsters",
        "specialFeatures": "Diverse textures. All-natural. High fiber.",
        "usageInstructions": "Feed 1-2 tablespoons daily. Scatter feed to encourage natural behavior."
    },
    {
        "id": "hamster_food_2",
        "category": "Hamsters",
        "subcategory": "Food",
        "name": "Hamster Pellets (500g)",
        "description": "A compact, vitamin-aligned diet that prevents selective feeding, ensuring your pet gets every bit of nutrition in every bite.",
        "price": 380.0,
        "image": "assets/images/hamster_food_2.jpg",
        "rating": 4.3,
        "ingredients": "Timothy Hay, Ground Corn, Soybean Meal, Vitamin Supplements",
        "healthBenefits": "Ensures full vitamin intake. Keeps teeth trimmed through grinding.",
        "targetAudience": "All hamster breeds",
        "specialFeatures": "Uniform nutrition. Low fat. No artificial colors.",
        "usageInstructions": "Can be mixed with seeds or fed alone as the main diet."
    },
    {
        "id": "hamster_food_3",
        "category": "Hamsters",
        "subcategory": "Food",
        "name": "Dried Vegetables Mix (200g)",
        "description": "A colorful, crunchy blend of garden favorites that provides essential antioxidants and fiber for a healthy digestive tract.",
        "price": 450.0,
        "image": "assets/images/hamster_food_3.jpg",
        "rating": 4.5,
        "ingredients": "Dried Carrots, Zucchini, Broccoli, Sweet Potato",
        "healthBenefits": "Rich in Beta-carotene and Vitamin C. Low sugar content compared to fruit.",
        "targetAudience": "Hamsters, Gerbils",
        "specialFeatures": "Freeze-dried for nutrients. No added sulfur.",
        "usageInstructions": "Add a small pinch to daily food for variety."
    },
    {
        "id": "hamster_toy_1",
        "category": "Hamsters",
        "subcategory": "Toys",
        "name": "Hamster Wheel Silent",
        "description": "An engineered, friction-free wheel that allows for miles of midnight running without making a sound in your bedroom.",
        "price": 1600.0,
        "image": "assets/images/hamster_toy_1.jpg",
        "rating": 4.2,
        "ingredients": "BPA-free Plastic, Dual Ball Bearings",
        "healthBenefits": "Prevents obesity. Essential for mental health and reducing stress.",
        "targetAudience": "Hamsters, Mice",
        "specialFeatures": "Solid surface (no wire gaps). Whisper quiet. Stand or cage mount.",
        "usageInstructions": "Ensure wheel is large enough (8-12 inches) so hamster's back doesn't arch."
    },
    {
        "id": "hamster_toy_2",
        "category": "Hamsters",
        "subcategory": "Toys",
        "name": "Wooden Hideout",
        "description": "A charming, bark-covered cottage made of safe, gnawable wood that doubles as a cozy bedroom and a dental chew.",
        "price": 700.0,
        "image": "assets/images/hamster_toy_2.jpg",
        "rating": 4.3,
        "ingredients": "Natural Pine Wood, Non-toxic Glue",
        "healthBenefits": "Provides a safe sleeping spot. Safe for gnawing to maintain teeth.",
        "targetAudience": "Small rodents",
        "specialFeatures": "Bark-covered. Multi-room design. Bark aids in tooth filing.",
        "usageInstructions": "Place in a corner. Clean with a damp cloth; do not soak."
    },
    {
        "id": "hamster_toy_3",
        "category": "Hamsters",
        "subcategory": "Toys",
        "name": "Tunnel System (3 pieces)",
        "description": "A modular, transparent playground that mimics natural underground burrows, providing endless exploration and exercise.",
        "price": 1200.0,
        "image": "assets/images/hamster_toy_3.jpg",
        "rating": 4.4,
        "ingredients": "Washable Plastic",
        "healthBenefits": "Simulates natural burrowing environments. Increases habitat square footage.",
        "targetAudience": "Active hamsters",
        "specialFeatures": "Air vents. Compatible with most modular cages. Transparent for viewing.",
        "usageInstructions": "Connect to cage ports. Disassemble weekly for deep cleaning."
    },
    {
        "id": "hamster_acc_1",
        "category": "Hamsters",
        "subcategory": "Accessories",
        "name": "Water Bottle (250ml)",
        "description": "A drip-proof, stainless-steel tipped bottle that ensures a constant supply of clean, debris-free water for your small pet.",
        "price": 350.0,
        "image": "assets/images/hamster_acc_1.jpg",
        "rating": 4.5,
        "ingredients": "Plastic Bottle, Stainless Steel Sipper Tube",
        "healthBenefits": "Keeps drinking water clean from bedding and food. Prevents dehydration.",
        "targetAudience": "Small animals",
        "specialFeatures": "Drip-resistant valve. Wire hanger included. BPA-free.",
        "usageInstructions": "Fill completely to create vacuum. Check the ball for movement daily."
    },
    {
        "id": "hamster_acc_2",
        "category": "Hamsters",
        "subcategory": "Accessories",
        "name": "Food Bowl Ceramic",
        "description": "A heavyweight, chew-proof dish that stays exactly where you put it, preventing spills and cage messes.",
        "price": 280.0,
        "image": "assets/images/hamster_acc_2.jpg",
        "rating": 4.2,
        "ingredients": "Kiln-fired Ceramic",
        "healthBenefits": "Hygienic and easy to clean. Prevents hamsters from flipping their food.",
        "targetAudience": "All hamsters",
        "specialFeatures": "Gnaw-proof. Heavyweight base. Smooth glaze.",
        "usageInstructions": "Place on a level surface. Wash with mild soap daily."
    },
    {
        "id": "hamster_acc_3",
        "category": "Hamsters",
        "subcategory": "Accessories",
        "name": "Bedding Material (1kg)",
        "description": "A cloud-soft, ultra-absorbent paper bedding that neutralizes ammonia odors and provides the perfect material for nesting.",
        "price": 550.0,
        "image": "assets/images/hamster_acc_3.jpg",
        "rating": 4.6,
        "ingredients": "Unbleached Paper Pulp",
        "healthBenefits": "Excellent ammonia control. Soft texture allows for complex burrowing.",
        "targetAudience": "All small pets",
        "specialFeatures": "99% dust free. Expands to 3x volume. Biodegradable.",
        "usageInstructions": "Spread 3-6 inches deep in the habitat. Spot clean daily."
    },
    {
        "id": "hamster_treat_1",
        "category": "Hamsters",
        "subcategory": "Treats",
        "name": "Yogurt Drops (100g)",
        "description": "Sweet, calcium-fortified treats that serve as the perfect tool for taming and bonding with your small furry friend.",
        "price": 320.0,
        "image": "assets/images/hamster_treat_1.jpg",
        "rating": 4.7,
        "ingredients": "Dried Whey, Palm Oil, Sugar, Lecithin, Yogurt Powder",
        "healthBenefits": "Small dose of calcium. High palatability for taming and bonding.",
        "targetAudience": "Hamsters, Gerbils",
        "specialFeatures": "Bite-sized. Creamy texture. Resealable bag.",
        "usageInstructions": "Give only 1-2 per week due to high sugar content."
    },
    {
        "id": "rabbit_food_1",
        "category": "Rabbits",
        "subcategory": "Food",
        "name": "Timothy Hay 5kg",
        "description": "Sun-cured, long-strand fiber that is the cornerstone of rabbit health, essential for digestive movement and dental wear.",
        "price": 3200.0,
        "image": "assets/images/rabbit_food_1.jpg",
        "rating": 4.6,
        "ingredients": "100% Sun-cured Timothy Hay",
        "healthBenefits": "80% of a rabbit's diet. Prevents GI stasis and grinds down teeth.",
        "targetAudience": "Adult Rabbits, Guinea Pigs",
        "specialFeatures": "Long strand fiber. Hand-selected. Low protein and calcium.",
        "usageInstructions": "Provide unlimited amounts. Hay should always be available."
    },
    {
        "id": "rabbit_food_2",
        "category": "Rabbits",
        "subcategory": "Food",
        "name": "Rabbit Pellets 2kg",
        "description": "A nutrient-dense, alfalfa-based pellet designed to support the high energy needs of young or growing bunnies.",
        "price": 2100.0,
        "image": "assets/images/rabbit_food_2.jpg",
        "rating": 4.4,
        "ingredients": "Alfalfa Meal, Wheat Middlings, Soybean Meal, Cane Molasses",
        "healthBenefits": "Concentrated vitamins and minerals. Supports energy levels in active bunnies.",
        "targetAudience": "Young rabbits (under 6 months) or nursing moms",
        "specialFeatures": "High calcium for bone growth. No corn or seeds.",
        "usageInstructions": "Limit to 1/4 cup per 2kg of body weight daily."
    },
    {
        "id": "rabbit_food_3",
        "category": "Rabbits",
        "subcategory": "Food",
        "name": "Mixed Vegetables (1kg)",
        "description": "A garden-fresh medley of dried treats that adds variety and excitement to your rabbit’s daily foraging routine.",
        "price": 850.0,
        "image": "assets/images/rabbit_food_3.jpg",
        "rating": 4.5,
        "ingredients": "Flaked Corn, Dried Peas, Flaked Carrots, Rosehips",
        "healthBenefits": "Vitamin boost. Rosehips are high in Vitamin C. Variety prevents boredom.",
        "targetAudience": "All rabbits",
        "specialFeatures": "Natural ingredients. No artificial coloring. Crunch aids tooth health.",
        "usageInstructions": "Sprinkle over hay to encourage foraging."
    },
    {
        "id": "rabbit_toy_1",
        "category": "Rabbits",
        "subcategory": "Toys",
        "name": "Chew Toy Set (5 pieces)",
        "description": "A curated collection of natural willow and applewood textures that satisfies the instinctual urge to gnaw and protects your home.",
        "price": 950.0,
        "image": "assets/images/rabbit_toy_1.jpg",
        "rating": 4.3,
        "ingredients": "Willow, Applewood, Loofah, Rattan",
        "healthBenefits": "Prevents overgrowth of incisors. Reduces destructive chewing of furniture.",
        "targetAudience": "Rabbits, Chinchillas",
        "specialFeatures": "100% natural materials. Pesticide-free. Variety of textures.",
        "usageInstructions": "Place throughout the play area. Discard when small enough to be swallowed."
    },
    {
        "id": "rabbit_toy_2",
        "category": "Rabbits",
        "subcategory": "Toys",
        "name": "Tunnel Hideout",
        "description": "A collapsible, crinkle-textured tunnel that provides a high-speed 'zoomie' track and a secure place to nap.",
        "price": 1200.0,
        "image": "assets/images/rabbit_toy_2.jpg",
        "rating": 4.4,
        "ingredients": "Polyester Fabric, Internal Steel Sprung Frame",
        "healthBenefits": "Provides a 'safe zone' for shy rabbits. Encourages exercise and running (zoomies).",
        "targetAudience": "Dwarf to Medium rabbits",
        "specialFeatures": "Peephole on top. Crinkle sound inside. Folds flat for storage.",
        "usageInstructions": "Do not leave with rabbits prone to eating fabric. Hand wash only."
    },
    {
        "id": "rabbit_toy_3",
        "category": "Rabbits",
        "subcategory": "Toys",
        "name": "Ball with Bell",
        "description": "An interactive, rolling toy that encourages your rabbit to nudge, toss, and play, stimulating both mind and body.",
        "price": 450.0,
        "image": "assets/images/rabbit_toy_3.jpg",
        "rating": 4.2,
        "ingredients": "Plastic Shell, Internal Metal Bell",
        "healthBenefits": "Promotes physical activity through tossing and pushing behavior.",
        "targetAudience": "Playful rabbits",
        "specialFeatures": "Hard plastic resists gnawing. Brightly colored. Stimulating sound.",
        "usageInstructions": "Encourage the rabbit to nose the ball for a sound reward."
    },
    {
        "id": "rabbit_acc_1",
        "category": "Rabbits",
        "subcategory": "Accessories",
        "name": "Grooming Brush",
        "description": "A soft-touch brush designed to gently remove loose fur, preventing dangerous hairballs and keeping the coat velveteen.",
        "price": 650.0,
        "image": "assets/images/rabbit_acc_1.jpg",
        "rating": 4.0,
        "ingredients": "Synthetic Soft Bristles, Rubber Handle",
        "healthBenefits": "Prevents hairballs (rabbits cannot vomit). Massages skin to improve circulation.",
        "targetAudience": "All rabbits, especially long-haired breeds",
        "specialFeatures": "Ergonomic grip. Gentle on sensitive skin. Easy to clean.",
        "usageInstructions": "Brush in the direction of hair growth. Use daily during molting seasons."
    },
    {
        "id": "rabbit_acc_2",
        "category": "Rabbits",
        "subcategory": "Accessories",
        "name": "Litter Box with Grate",
        "description": "A smart, space-saving corner box that keeps paws dry and simplifies the process of house-training your rabbit.",
        "price": 1500.0,
        "image": "assets/images/rabbit_acc_2.jpg",
        "rating": 4.5,
        "ingredients": "Polished Plastic, Removable Wire Grate",
        "healthBenefits": "Keeps paws clean from waste. Encourages litter training and hygiene.",
        "targetAudience": "Indoor house rabbits",
        "specialFeatures": "High back to prevent sprays. Wire floor keeps rabbit dry.",
        "usageInstructions": "Place in the corner where the rabbit naturally goes. Fill with paper-based litter."
    },
    {
        "id": "rabbit_acc_3",
        "category": "Rabbits",
        "subcategory": "Accessories",
        "name": "Hay Feeder Rack",
        "description": "A tidy, wall-mounted solution that keeps essential hay off the floor, ensuring it stays clean, dry, and appetizing.",
        "price": 850.0,
        "image": "assets/images/rabbit_acc_3.jpg",
        "rating": 4.6,
        "ingredients": "Powder-coated Metal Wire",
        "healthBenefits": "Prevents hay from being soiled by urine or droppings. Encourages upright eating posture.",
        "targetAudience": "All small herbivores",
        "specialFeatures": "Easy to refill. Attaches to any wire cage. Durable construction.",
        "usageInstructions": "Mount above the litter box as rabbits like to eat while they go."
    },
    {
        "id": "rabbit_treat_1",
        "category": "Rabbits",
        "subcategory": "Treats",
        "name": "Carrot Chips (200g)",
        "description": "100% natural, dehydrated carrot slices that offer a healthy, vitamin-A-rich crunch for special bonding moments.",
        "price": 420.0,
        "image": "assets/images/rabbit_treat_1.jpg",
        "rating": 4.7,
        "ingredients": "100% Dried Carrots",
        "healthBenefits": "Vitamin A and Beta-carotene. High crunch factor for dental health.",
        "targetAudience": "All rabbits",
        "specialFeatures": "No added sugar or oil. Real carrot slices. Hand-packed.",
        "usageInstructions": "Give 1-2 chips daily. Carrots are high in natural sugar, so use sparingly."
    },
    {
        "id": "turtle_food_1",
        "category": "Turtles",
        "subcategory": "Food",
        "name": "Aquatic Turtle Pellets (500g)",
        "description": "A floating, protein-forward diet designed to support a hard, healthy shell and vigorous swimming activity.",
        "price": 520.0,
        "image": "assets/images/turtle_food_1.jpg",
        "rating": 4.2,
        "ingredients": "Fish Meal, Soybean Meal, Wheat Flour, Yeast, Vitamin C, Calcium",
        "healthBenefits": "High protein for shell development. Floating pellets mimic natural surface feeding.",
        "targetAudience": "Red-Eared Sliders, Painted Turtles",
        "specialFeatures": "Stays afloat. Doesn't cloud water. Fortified with vitamins.",
        "usageInstructions": "Feed as much as they can eat in 5 minutes. Remove leftovers."
    },
    {
        "id": "turtle_food_2",
        "category": "Turtles",
        "subcategory": "Food",
        "name": "Dried Shrimp (200g)",
        "description": "A savory, calcium-rich treat that mimics the natural aquatic prey of turtles, perfect for a high-energy protein boost.",
        "price": 650.0,
        "image": "assets/images/turtle_food_2.jpg",
        "rating": 4.5,
        "ingredients": "100% Whole Dried Gammarus Shrimp",
        "healthBenefits": "Natural source of chitin for shell strength. High protein boost.",
        "targetAudience": "Aquatic turtles and large fish",
        "specialFeatures": "Natural smell and taste. Sun-dried. Rich in calcium.",
        "usageInstructions": "Use as a treat or primary source 3 times per week."
    },
    {
        "id": "turtle_food_3",
        "category": "Turtles",
        "subcategory": "Food",
        "name": "Turtle Sticks (300g)",
        "description": "A balanced, fiber-rich formula that incorporates essential plant matter for the long-term health of semi-aquatic species.",
        "price": 580.0,
        "image": "assets/images/turtle_food_3.jpg",
        "rating": 4.3,
        "ingredients": "Corn Meal, Fish Meal, Calcium Carbonate, Kale Powder",
        "healthBenefits": "High fiber for digestion. Balanced calcium-phosphorus ratio.",
        "targetAudience": "Box Turtles, Semi-aquatic turtles",
        "specialFeatures": "Easy to grab. Low waste. Includes plant matter.",
        "usageInstructions": "Provide in a feeding dish on land or float in water."
    },
    {
        "id": "turtle_toy_1",
        "category": "Turtles",
        "subcategory": "Toys",
        "name": "Basking Platform",
        "description": "A textured, easy-climb ramp that allows turtles to fully exit the water and absorb life-sustaining UV rays.",
        "price": 1250.0,
        "image": "assets/images/turtle_toy_1.jpg",
        "rating": 4.3,
        "ingredients": "BPA-free Plastic, Suction Cups",
        "healthBenefits": "Allows turtle to dry shell completely, preventing rot. Essential for thermoregulation.",
        "targetAudience": "Aquatic turtles",
        "specialFeatures": "Textured ramp for grip. Adjustable height. Floating design.",
        "usageInstructions": "Place under the UVB/Heat lamp. Ensure it's stable for the turtle's weight."
    },
    {
        "id": "turtle_toy_2",
        "category": "Turtles",
        "subcategory": "Toys",
        "name": "Floating Dock",
        "description": "A self-leveling, rock-textured island that adjusts to your tank's water level, providing a consistent spot for sunning.",
        "price": 1500.0,
        "image": "assets/images/turtle_toy_2.jpg",
        "rating": 4.4,
        "ingredients": "Non-toxic Polyurethane Foam",
        "healthBenefits": "Self-levels with water changes. Provides a larger surface for multiple turtles.",
        "targetAudience": "Growing turtles",
        "specialFeatures": "Realistic stone look. Submerged ramp. No sharp edges.",
        "usageInstructions": "Secure to the glass wall with suction cups. Wash during tank cleaning."
    },
    {
        "id": "turtle_toy_3",
        "category": "Turtles",
        "subcategory": "Toys",
        "name": "Aquarium Decoration Rock",
        "description": "A heavy, resin-molded formation that creates an underwater cave system for resting and exploration.",
        "price": 950.0,
        "image": "assets/images/turtle_toy_3.jpg",
        "rating": 4.1,
        "ingredients": "Eco-friendly Resin",
        "healthBenefits": "Provides underwater shelter. Reduces stress in community tanks.",
        "targetAudience": "All aquatic setups",
        "specialFeatures": "Flat top for resting. Safe for water chemistry. Realistic moss detail.",
        "usageInstructions": "Rinse before use. Place on the bottom before adding water."
    },
    {
        "id": "turtle_acc_1",
        "category": "Turtles",
        "subcategory": "Accessories",
        "name": "Shell Cleaner (250ml)",
        "description": "A gentle, aloe-infused solution that conditions the scutes and safely removes unsightly algae or mineral buildup.",
        "price": 480.0,
        "image": "assets/images/turtle_acc_1.jpg",
        "rating": 4.1,
        "ingredients": "Water, Gentle Surfactants, Aloe Vera, Vitamin E",
        "healthBenefits": "Removes algae and mineral deposits. Conditions the shell to prevent cracking.",
        "targetAudience": "All turtles and tortoises",
        "specialFeatures": "Fragrance free. Non-toxic if swallowed. Easy pump bottle.",
        "usageInstructions": "Apply to a soft brush, gently scrub shell, and rinse with lukewarm water."
    },
    {
        "id": "turtle_acc_2",
        "category": "Turtles",
        "subcategory": "Accessories",
        "name": "UVB Light Bulb",
        "description": "A critical habitat component that provides the specific light spectrum necessary for calcium metabolism and shell strength.",
        "price": 1800.0,
        "image": "assets/images/turtle_acc_2.jpg",
        "rating": 4.6,
        "ingredients": "Quartz Glass, UVB Phosphors",
        "healthBenefits": "Required for Vitamin D3 synthesis. Prevents metabolic bone disease and shell soft spots.",
        "targetAudience": "All reptiles, especially turtles",
        "specialFeatures": "High output. Fits standard E26 sockets. 12-month effectiveness.",
        "usageInstructions": "Replace every 6-12 months even if it still glows. Position 10-12 inches away."
    },
    {
        "id": "turtle_acc_3",
        "category": "Turtles",
        "subcategory": "Accessories",
        "name": "Water Heater (50W)",
        "description": "A shatterproof, submersible heater that keeps water temperatures stable to prevent lethargy and respiratory illness.",
        "price": 2200.0,
        "image": "assets/images/turtle_acc_3.jpg",
        "rating": 4.5,
        "ingredients": "Shatterproof Glass, Thermal Ceramic core",
        "healthBenefits": "Maintains constant metabolism and activity levels. Prevents respiratory infections.",
        "targetAudience": "Tanks up to 50 Liters",
        "specialFeatures": "Auto shut-off. Protective plastic guard. Precise temp dial.",
        "usageInstructions": "Install horizontally near water flow. Unplug during water changes."
    },
    {
        "id": "turtle_treat_1",
        "category": "Turtles",
        "subcategory": "Treats",
        "name": "Calcium Block",
        "description": "A slow-release mineral star that conditions the water while providing an essential 'peck-able' source of calcium for beak health.",
        "price": 350.0,
        "image": "assets/images/turtle_treat_1.jpg",
        "rating": 4.7,
        "ingredients": "Calcium Sulfate, Magnesium, Vitamin D3",
        "healthBenefits": "Slow-release calcium. Helps neutralize water acidity. Keeps beaks trimmed.",
        "targetAudience": "Aquatic turtles",
        "specialFeatures": "Turtle-shaped. Slow dissolving. Fortified with vitamins.",
        "usageInstructions": "Drop into water. Replace once completely dissolved."
    }
]